text="Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. ."
print(text)

a=input("Введите недостающее первое слово:")
print(a)

a=input("Введите недостающую первую букву для слова кожиц..й:")
print(a)

a=input("Введите недостающее второе слово:")
print(a)

a=input("Введите недостающую вторую букву для слова ножк... :")
print(a)

a=input("Введите недостающее третье слово:")
print(a)

a=input("Введите недостающее четвертое слово:")
print(a)

a=input("Введите недостающую третью букву для слова шляпк... :")
print(a)