text=("Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .")
print(text)

a=input("Введите недостающее первое слово:")
print(a)

b=input("Введите недостающую первую букву для слова кожиц..й:")
print(b)

c=input("Введите недостающее второе слово:")
print(c)

d=input("Введите недостающую вторую букву для слова ножк... :")
print(d)

e=input("Введите недостающее третье слово:")
print(e)

r=input("Введите недостающее четвертое слово:")
print(r)

y=input("Введите недостающую третью букву для слова шляпк... :")
print(y)